{
  "backend/main.mo": "Motoko canister managing user profiles, player progress, score submissions, and leaderboard retrieval with authorization checks.",
  "feature_evidence.json": "Structured report mapping implemented game features to source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Reference list summarizing major frontend files with brief descriptions of their purpose.",
  "frontend/index.css": "Tailwind CSS setup defining global OKLCH color variables and dark mode theming.",
  "frontend/index.html": "Base HTML entry point mounting the React app and loading the main TypeScript bundle.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for all pages and wraps the app in a theme provider and toaster.",
  "frontend/src/components/game/GameOverDialog.tsx": "Overlay dialog shown on game over offering restart and return-to-menu options.",
  "frontend/src/components/game/HUD.tsx": "Displays game HUD with score, coins, timers, speed, health, nitro charge, active power-ups, and pause/restart buttons.",
  "frontend/src/components/game/LevelCompleteDialog.tsx": "Shows a modal with level completion stats and buttons for next level or returning to menu.",
  "frontend/src/components/game/PauseOverlay.tsx": "Renders a pause menu with options to resume, restart, open settings, or return to main menu.",
  "frontend/src/components/game/TouchControls.tsx": "Provides on-screen touch controls for left, right, and boost actions.",
  "frontend/src/components/ProfileSetupDialog.tsx": "Modal dialog allowing authenticated users to enter and save their profile name.",
  "frontend/src/game/assets.ts": "Defines asset paths and provides functions to preload all images into memory.",
  "frontend/src/game/cars.ts": "Defines car configurations, stats, and asset mappings for each car type.",
  "frontend/src/game/engine.ts": "Implements the main game engine managing state, updates, input, collisions, spawning, power-ups, and nitro logic.",
  "frontend/src/game/input.ts": "Manages keyboard and touch input states for movement and boosting.",
  "frontend/src/game/levels.ts": "Defines level configurations, ordering, and retrieves the next level in progression.",
  "frontend/src/game/powerups.ts": "Defines power-up types, structures, durations, and descriptions.",
  "frontend/src/game/render.ts": "Implements GameRenderer to draw backgrounds, objects, power-ups, and the player onto a canvas using game state.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, refetching dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity login, persistence, and status management.",
  "frontend/src/hooks/useProgress.ts": "Loads, updates, and saves player progress either locally or via backend depending on authentication state.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating progress, scores, and user profiles through the actor.",
  "frontend/src/hooks/useSettings.ts": "Manages game settings by combining backend-stored audio flags with locally stored graphics and control preferences.",
  "frontend/src/index.css": "Tailwind CSS setup with custom variables and neon-themed utility classes for styling.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider and renders the root component.",
  "frontend/src/pages/GamePage.tsx": "Initializes and runs the main game loop, handling rendering, engine updates, state transitions, and UI overlays like pause, level complete, and game over.",
  "frontend/src/pages/GaragePage.tsx": "Displays available cars, their unlock status, and allows players to purchase and unlock cars using coins.",
  "frontend/src/pages/HowToPlayPage.tsx": "Shows instructions for controls, objectives, power-ups, collectibles, and obstacles to guide players on gameplay basics.",
  "frontend/src/pages/LeaderboardPage.tsx": "Fetches and displays global top scores and personal bests, formatting score data and levels for the leaderboard UI.",
  "frontend/src/pages/MainMenuPage.tsx": "Renders the main menu with options to start, continue, view garage, leaderboard, and manage authentication and profile setup.",
  "frontend/src/pages/SettingsPage.tsx": "Renders the game settings UI with audio toggles, graphics quality selector, and controls options using custom hooks and styled components.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading URL parameters, persisting them in sessionStorage, and cleaning them from the URL hash.",
  "frontend/tailwind.config.js": "Configures Tailwind CSS with custom neon color palette, animations, plugins, and theme extensions.",
  "project_state.json": "Describes the game project state, feature list, required assets, and high-level design details for Speed Racer: Urban Drift."
}